export const langConfig = {
  jp: {
    homeview: {
      announcement: '公告：本サイトのエピソード',
      announcement1: 'いらっしゃります,',
      announcement2: 'dmlのサイトへ。',
      announcement3: '普通な普通なプログラマーとして、ここで生活や推し活を記録してる。',
      contents: [
        '普通のエンジニアとして、特別に優れた技術があるわけではありませんが、フロントエンドの勉強の一環として、このサイトを作ってみました。',
        'アニメやゲームなどの二次元文化が好きで、J-POPにも触れるようになりました。ある出来事をきっかけに、J-POPアイドルを追いかけるようになりました。',
        'ライブに行ったり、CDを買ったりするために、2023年から日本語の勉強を始めました。週2回、仕事終わりに日本語教室に通い、1年間で『標準日本語 中級』を学び終えました。その後、なんとなく受けた日本語能力試験で、気がつけばN1に合格していました。',
        'そして、日本への渡航を決意。',
        'ちょっと変わったきっかけではありますが、現在は日本で社会人として働いています！',
      ],
    },
    miletHomeView: {
      title0: 'miletについて',
      title1: 'milet写真集 Gallery',
      title2: 'miletの活動軌跡',
      title3: 'miletの公式サイト',
      title4: 'miletの公式SNS',
    },
    miletsite: {
      tips1:
        'milet公式Insgramのいプロフィールを埋め込みたかったですが、Insgramのプライバシーポリシーの関係でビジネスアカウント（本人）でないと対応できないようで、諦めました。',
    },
    miletPic: {
      tip: '当サイトに掲載している画像の一部は、インタネットやMVから引用しています。FCの限定画像についてはできるだけ掲載しないように気を付けていますが、もし見落としがあったらごめんなさい！！',
    },
    miletGallery: {
      tip: '当サイトに掲載している画像の一部は、インタネットやMVから引用しています。FCの限定画像についてはできるだけ掲載しないように気を付けていますが、もし見落としがあったらごめんなさい！！',
      topAlbums: 'ピックアップアルバム',
      albums: 'すべてのアルバム',
      toptip: '固定アルバム',
    },
  },
  zh: {
    homeview: {
      announcement: '公告：关于本站的小故事',
      announcement1: '欢迎来到',
      announcement2: 'dml 的小站',
      announcement3:
        '，一个普通的在日码农。这里记录生活片段、追星旅程与学习过程，希望你在这里也能找到共鸣。',
      contents: [
        '作为一个普通的不能再普通的码农，技术称不上很强，学习前端顺便创建了这个网站。',
        '个人是喜欢动漫，游戏，也接触j-pop，某件事为契机开始追星j-pop。',
        '为了方便追live买CD，2023年开始学习日语。一周2节课,下班之后去日语教室，为期一年的课程学完了标准日本语中级。之后又莫名其妙的情况下考过了N1',
        '然后踏上了赴日之旅。',
        '虽然赴日动机比较奇怪，目前也是在日社畜一枚！！！',
      ],
    },
    miletHomeView: {
      title0: '关于milet',
      title1: '照片集 Gallery',
      title2: ' milet活动轨迹',
      title3: 'milet官方网站',
      title4: 'milet官方SNS',
    },
    miletsite: {
      tips1:
        '原本想要添加milet官方INS的主页，但是INS的隐私策略问题，非企业账号（本人账号）太困难了，放弃。',
    },
    miletPic: {
      tip: '提示：本站图片部分来自网络、MV；尽可能避免fc图片外泄，可能会有漏网之鱼',
    },
    miletGallery: {
      tip: '提示：本站图片部分来自网络、MV；尽可能避免fc图片外泄，可能会有漏网之鱼',
      topAlbums: '精选相册',
      albums: '所有相册',
      toptip: '置顶相册',
    },
  },
} as LangConfig
